aulas/app/Controllers/Pessoa.php

        public static function exibir(): string{
            $pessoaModel = new PessoaModel;

            $data['pessoas'] = $pessoaModel->findAll();
---
SELECT *
FROM `Pessoa`

        public function inserir()
        {
        $data['titulo'] = 'Inserir nova Pessoa';
        $data['acao'] = 'INSERIR';
        $data['msg'] = '';
        if($this->request->getMethod() === 'post')
        {
        $pessoaModel = new \App\Models\PessoaModel();
        $pessoaModel->set('Nome', $this->request->getPost('Nome'));
        $pessoaModel->set('Naturalidade', $this->request->getPost('Naturalidade'));
        if ($pessoaModel->insert())
---
INSERT INTO `Pessoa` (`Nome`, `Naturalidade`) VALUES ('Felipe', 'Brasileiro')